---
kind: method
id: M:Autodesk.Revit.DB.Form.IsFaceReference(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/4ac6fa18-0375-70d3-a584-114c6675a18b.htm
---
# Autodesk.Revit.DB.Form.IsFaceReference Method

**中文**: 对话框、窗口、窗体

Tell if the pick is the reference to a face of the form.

## Syntax (C#)
```csharp
public bool IsFaceReference(
	Reference faceReference
)
```

## Parameters
- **faceReference** (`Autodesk.Revit.DB.Reference`) - Reference to be checked.